import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
//***
//        Реализуйте  удаление лишних символов при вводе номера телефона в консоли и
//        проверку соответствия номера формату мобильных номеров России.
//                Если введённую строку нельзя привести к формату мобильного номера —
//        выводите сообщение о неверном вводе. Телефон может быть введен не только в формате 79091234567,
//                но и с лишними символами.
// ***
    }
}